{"command.restartServer":"Riavvia server","extension.description":"Importare il supporto dell'organizzazione per i file Python usando isort.","settings.args.description":"Argomenti passati a isort per organizzare le importazioni nei file Python. Ogni argomento deve essere specificato come stringa separata nell'array. <br> Esempio: <br> '\"isort.args\" = [\"--settings-file\", \"<file>\"]'","settings.check.description":"Indica se eseguire `isort --check` nei file Python aperti e se segnalare i problemi di ordinamento come \"Suggerimento\" nella finestra Problemi. È possibile aggiornare `isort.severity` per mostrare l'ordinamento dei problemi con gravità superiore. ","settings.importStrategy.description":"Definisce il file binario di isort da usare per il lint dei file Python. Quando impostata su `useBundled`, l'estensione userà il file binario di isort fornito con l'estensione. Se impostata su `fromEnvironment`, l'estensione tenterà di usare il file binario di isort e tutte le dipendenze disponibili nell'ambiente attualmente selezionato. Nota: se l'estensione non riesce a trovare un file binario isort valido nell'ambiente selezionato, verrà eseguito il fallback all'uso del file binario di isort fornito con l'estensione. L’impostazione `pylint.path` può anche essere ignorata quando questa è impostata su `fromEnvironment`. ","settings.importStrategy.fromEnvironment.description":"Usare isort dall'ambiente selezionato. Se l'estensione non riesce a trovare un file binario di isort valido, verrà eseguito il fallback all'uso della versione di isort nel pacchetto.","settings.importStrategy.useBundled.description":"Usare sempre la versione di isort nel pacchetto fornita con l'estensione.","settings.interpreter.description":"Percorso di un eseguibile Python o di un comando che verrà usato per avviare il server isort e qualsiasi sottoprocesso. Accetta una matrice di una o più stringhe. Se impostata su `[]`, l'estensione userà il percorso dell'interprete Python selezionato.","settings.path.description":"Percorso del binario isort che deve usare questa estensione. Nota: questa operazione potrebbe rallentare la formattazione. <br> Esempi: <br>- '\"isort.path\" : [\"~/global_env/isort\"]' <br> - '\"isort.path\" : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]'. ","settings.serverEnabled.description":"Impostazione **sperimentale** per controllare se eseguire isort in modalità server. Per impostazione predefinita, `isort` viene eseguito dietro il server LSP, ma è possibile disabilitare questa impostazione per eseguire direttamente isort. La disabilitazione di questa impostazione disabiliterà anche l'ordinamento delle importazioni tramite Azioni codice o Organizza importazioni, ma è comunque possibile ordinare le importazioni tramite il comando **isort: Sort Imports**.","settings.severity.description":"Mapping dei tipi di messaggio di isort con i livelli di gravità diagnostica di VS Code, come visualizzati nella finestra Problemi.","settings.showNotifications.always.description":"Mostra tutte le notifiche.","settings.showNotifications.description":"Controlla quando mostrare le notifiche da questa estensione.  I valori accettati sono 'onError', 'onWarning', 'always' e 'off'.","settings.showNotifications.off.description":"Non visualizzare mai una notifica. Eventuali errori o avvisi sono ancora disponibili nei log.","settings.showNotifications.onError.description":"Mostra le notifiche per gli errori.","settings.showNotifications.onWarning.description":"Mostra le notifiche per errori e avvisi."}
