{
    "extension.description": "Import organization support for Python files using isort.",
    "command.restartServer": "Restart Server",
    "settings.args.description": "Arguments passed to isort for organizing imports in Python files. Each argument should be provided as a separate string in the array. <br> Example: <br> `\"isort.args\" = [\"--settings-file\", \"<file>\"]`",
    "settings.check.description": "Whether to run `isort --check` on open Python files and report sorting issues as a \"Hint\" in the Problems window. You can update `isort.severity` to show sorting issues with higher severity. ",
    "settings.severity.description": "Mapping of isort's message types to VS Code's diagnostic severity levels as displayed in the Problems window.",
    "settings.serverEnabled.description" : "**Experimental** setting to control whether to run isort in a server-like mode. By default `isort` is run behind LSP server, but you can disable this setting to run isort directly. Disabling this setting will also disable import sorting via Code Actions or Organize Imports, but you can still sort imports through the **isort: Sort Imports** command.",
    "settings.path.description": "Path of the isort binary to be used by this extension. Note: This may slow down formatting. <br> Examples: <br>- `isort.path : [\"~/global_env/isort\"]` <br> - `isort.path : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]`. ",
    "settings.importStrategy.description": "Defines which isort binary to be used to lint Python files. When set to `useBundled`, the extension will use the isort binary that is shipped with the extension. When set to `fromEnvironment`, the extension will attempt to use the isort binary and all dependencies that are available in the currently selected environment. Note: If the extension can't find a valid isort binary in the selected environment, it will fallback to using the isort binary that is shipped with the extension The `isort.path` setting may also be ignored when this setting is set to `fromEnvironment`. ",
    "settings.importStrategy.useBundled.description": "Always use the bundled version of isort shipped with the extension.",
    "settings.importStrategy.fromEnvironment.description": "Use isort from the selected environment. If the extension fails to find a valid isort binary, it will fallback to using the bundled version of isort.",
    "settings.interpreter.description": "Path to a Python executable or a command that will be used to launch the isort server and any subprocess. Accepts an array of a single or multiple strings. When set to `[]`, the extension will use the path to the selected Python interpreter.",
    "settings.showNotifications.description": "Controls when notifications are shown by this extension.  Accepted values are `onError`, `onWarning`, `always` and `off`.",
    "settings.showNotifications.off.description": "Never display a notification. Any errors or warning are still available in the logs.",
    "settings.showNotifications.onError.description": "Show notifications for errors.",
    "settings.showNotifications.onWarning.description": "Show notifications for errors and warnings.",
    "settings.showNotifications.always.description": "Show all notifications."
}
