{"command.restartServer":"Server neu starten","extension.description":"Importorganisationsunterstützung für Python-Dateien die \"isort\" verwenden.","settings.args.description":"An „isort“ übergebene Argumente zum Organisieren von Importen in Python-Dateien. Jedes Argument sollte als separate Zeichenfolge im Array bereitgestellt werden. <br> Beispiel: <br> „\"isort.args\" : [\"--settings-file\", \"<file>\"]“","settings.check.description":"Gibt an, ob \"\"isort\" --check\" für geöffnete Python-Dateien ausgeführt und Sortierprobleme als \"Hinweis\" im Fenster \"Probleme\" gemeldet werden sollen. Sie können \"isort.severity\" aktualisieren, um Sortierprobleme mit höherem Schweregrad anzuzeigen. ","settings.importStrategy.description":"Definiert, welche Isort-Binärdatei zum Lintieren von Python-Dateien verwendet werden soll. Bei Festlegung auf \"useBundled\" verwendet die Erweiterung die isort-Binärdatei, die mit der Erweiterung ausgeliefert wird. Bei Festlegung auf \"fromEnvironment\" versucht die Erweiterung, die Isort-Binärdatei und alle Abhängigkeiten zu verwenden, die in der aktuell ausgewählten Umgebung verfügbar sind. Hinweis: Wenn die Erweiterung in der ausgewählten Umgebung keine gültige Isort-Binärdatei finden kann, wird ein Fallback auf die Verwendung der isort-Binärdatei ausgeführt, die mit der Erweiterung geliefert wird. Die Einstellung \"isort.path\" wird möglicherweise auch ignoriert, wenn diese Einstellung auf \"fromEnvironment\" festgelegt ist. ","settings.importStrategy.fromEnvironment.description":"Verwenden Sie \"isort\" aus der ausgewählten Umgebung. Wenn die Erweiterung keine gültige Isort-Binärdatei findet, wird ein Fallback auf die Verwendung der gebündelten Version von \"isort\" ausgeführt.","settings.importStrategy.useBundled.description":"Verwenden Sie immer die gebündelte Version von isort, die mit der Erweiterung ausgeliefert wird.","settings.interpreter.description":"Pfad zu einer ausführbaren Python-Datei oder einem Befehl, der zum Starten des Isort-Servers und eines beliebigen Unterprozesses verwendet wird. Akzeptiert ein Array aus einer einzelnen oder mehreren Zeichenfolgen. Bei Festlegung auf \"[]\" verwendet die Erweiterung den Pfad zum ausgewählten Python-Interpreter.","settings.path.description":"Pfad der isort-Binärdatei, die von dieser Erweiterung verwendet werden soll. Hinweis: Dies kann die Formatierung verlangsamen. <br> Beispiele: <br>– „\"isort.path\" : [\"~/global_env/isort\"]“ <br> – „\"isort.path\" : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]“. ","settings.serverEnabled.description":"**Experimentelle** Einstellung, um zu steuern, ob \"isort\" in einem serverähnlichen Modus ausgeführt werden soll. Standardmäßig wird \"isort\" hinter dem LSP-Server ausgeführt. Sie können diese Einstellung jedoch deaktivieren, um \"isort\" direkt auszuführen. Wenn Sie diese Einstellung deaktivieren, wird auch die Importsortierung über \"Codeaktionen\" oder \"Importe organisieren\" deaktiviert. Sie können Importe jedoch weiterhin mithilfe des Befehls **isort: Importe sortieren** sortieren.","settings.severity.description":"Zuordnung der Nachrichtentypen von \"isort\" zu den Diagnoseschweregraden VS Code, wie im Fenster \"Probleme\" angezeigt.","settings.showNotifications.always.description":"Alle Benachrichtigungen anzeigen.","settings.showNotifications.description":"Steuert, wann Benachrichtigungen von dieser Erweiterung angezeigt werden.  Zulässige Werte sind \"onError\", \"onWarning\", \"always\" und \"off\".","settings.showNotifications.off.description":"Nie eine Benachrichtigung anzeigen. Alle Fehler oder Warnungen sind weiterhin in den Protokollen verfügbar.","settings.showNotifications.onError.description":"Benachrichtigungen für Fehler anzeigen.","settings.showNotifications.onWarning.description":"Benachrichtigungen für Fehler und Warnungen anzeigen."}
