{"command.restartServer":"Rëstært §ërvër","extension.description":"Ïmpørt ørgæñïzætïøñ sµppørt før Pÿthøñ fïlës µsïñg ïsørt.","settings.args.description":"Ærgµmëñts pæssëð tø ïsørt før ørgæñïzïñg ïmpørts ïñ Pÿthøñ fïlës. Ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ. <þr> Ëxæmplë: <þr> `\"ïsørt.ærgs\" : [\"--sëttïñgs-fïlë\", \"<fïlë>\"]`","settings.check.description":"Whëthër tø rµñ `ïsørt --çhëçk` øñ øpëñ Pÿthøñ fïlës æñð rëpørt sørtïñg ïssµës æs æ \"Hïñt\" ïñ thë Prøþlëms wïñðøw. Ýøµ çæñ µpðætë `ïsørt.sëvërïtÿ` tø shøw sørtïñg ïssµës wïth hïghër sëvërïtÿ. ","settings.importStrategy.description":"Ðëfïñës whïçh ïsørt þïñærÿ tø þë µsëð tø lïñt Pÿthøñ fïlës. Whëñ sët tø `µsëßµñðlëð`, thë ëxtëñsïøñ wïll µsë thë ïsørt þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ. Whëñ sët tø `frømËñvïrøñmëñt`, thë ëxtëñsïøñ wïll ættëmpt tø µsë thë ïsørt þïñærÿ æñð æll ðëpëñðëñçïës thæt ærë ævæïlæþlë ïñ thë çµrrëñtlÿ sëlëçtëð ëñvïrøñmëñt. Ñøtë: Ïf thë ëxtëñsïøñ çæñ't fïñð æ vælïð ïsørt þïñærÿ ïñ thë sëlëçtëð ëñvïrøñmëñt, ït wïll fællþæçk tø µsïñg thë ïsørt þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ Thë `ïsørt.pæth` sëttïñg mæÿ ælsø þë ïgñørëð whëñ thïs sëttïñg ïs sët tø `frømËñvïrøñmëñt`. ","settings.importStrategy.fromEnvironment.description":"Üsë ïsørt frøm thë sëlëçtëð ëñvïrøñmëñt. Ïf thë ëxtëñsïøñ fæïls tø fïñð æ vælïð ïsørt þïñærÿ, ït wïll fællþæçk tø µsïñg thë þµñðlëð vërsïøñ øf ïsørt.","settings.importStrategy.useBundled.description":"Ælwæÿs µsë thë þµñðlëð vërsïøñ øf ïsørt shïppëð wïth thë ëxtëñsïøñ.","settings.interpreter.description":"Pæth tø æ Pÿthøñ ëxëçµtæþlë ør æ çømmæñð thæt wïll þë µsëð tø læµñçh thë ïsørt sërvër æñð æñÿ sµþprøçëss. Æççëpts æñ ærræÿ øf æ sïñglë ør mµltïplë strïñgs. Whëñ sët tø `[]`, thë ëxtëñsïøñ wïll µsë thë pæth tø thë sëlëçtëð Pÿthøñ ïñtërprëtër.","settings.path.description":"Pæth øf thë ïsørt þïñærÿ tø þë µsëð þÿ thïs ëxtëñsïøñ. Ñøtë: Thïs mæÿ sløw ðøwñ førmættïñg. <þr> Ëxæmplës: <þr>- `\"ïsørt.pæth\" : [\"~/gløþæl_ëñv/ïsørt\"]` <þr> - `\"ïsørt.pæth\" : [\"çøñðæ\", \"rµñ\", \"-ñ\", \"lïñt_ëñv\", \"pÿthøñ\", \"-m\", \"ïsørt\"]`. ","settings.serverEnabled.description":"**Ëxpërïmëñtæl** sëttïñg tø çøñtrøl whëthër tø rµñ ïsørt ïñ æ sërvër-lïkë møðë. ßÿ ðëfæµlt `ïsørt` ïs rµñ þëhïñð £§P sërvër, þµt ÿøµ çæñ ðïsæþlë thïs sëttïñg tø rµñ ïsørt ðïrëçtlÿ. Ðïsæþlïñg thïs sëttïñg wïll ælsø ðïsæþlë ïmpørt sørtïñg vïæ Çøðë Æçtïøñs ør Ørgæñïzë Ïmpørts, þµt ÿøµ çæñ stïll sørt ïmpørts thrøµgh thë **ïsørt: §ørt Ïmpørts** çømmæñð.","settings.severity.description":"Mæppïñg øf ïsørt's mëssægë tÿpës tø V§ Çøðë's ðïægñøstïç sëvërïtÿ lëvëls æs ðïsplæÿëð ïñ thë Prøþlëms wïñðøw.","settings.showNotifications.always.description":"§høw æll ñøtïfïçætïøñs.","settings.showNotifications.description":"Çøñtrøls whëñ ñøtïfïçætïøñs ærë shøwñ þÿ thïs ëxtëñsïøñ.  Æççëptëð vælµës ærë `øñËrrør`, `øñWærñïñg`, `ælwæÿs` æñð `øff`.","settings.showNotifications.off.description":"Ñëvër ðïsplæÿ æ ñøtïfïçætïøñ. Æñÿ ërrørs ør wærñïñg ærë stïll ævæïlæþlë ïñ thë løgs.","settings.showNotifications.onError.description":"§høw ñøtïfïçætïøñs før ërrørs.","settings.showNotifications.onWarning.description":"§høw ñøtïfïçætïøñs før ërrørs æñð wærñïñgs."}
