{"command.restartServer":"Reiniciar Servidor","extension.description":"Suporte da organização de importação para arquivos Python usando `isort`.","settings.args.description":"Argumentos passados para o isort para organizar importações em arquivos Python. Cada argumento deve ser fornecido como uma cadeia de caracteres separada na matriz. <br> Exemplo: <br> `\"isort.args\" : [\"--settings-file\", \"<file>\"]`","settings.check.description":"Se desejar executar 'isort --verificação' em arquivos Python abertos e relatar problemas de classificação como uma \"Dica\" na janela Problemas. Você pode atualizar 'isort.severity' para mostrar problemas de classificação com gravidade mais alta. ","settings.importStrategy.description":"Define qual binário do isort será usado para fazer lint de arquivos do Python. Quando definida como `useBundled`, a extensão usará o binário do isort que acompanha a extensão. Quando definida como `fromEnvironment`, a extensão tentará usar o binário do isort e todas as dependências disponíveis no ambiente atualmente selecionado. Observação: se a extensão não conseguir encontrar um binário do isort válido no ambiente selecionado, ela voltará a usar o binário do isort fornecido com a extensão. A configuração `isort.path` também pode ser ignorada quando esta configuração for definida como `fromEnvironment`. ","settings.importStrategy.fromEnvironment.description":"Use isort do ambiente selecionado. Se a extensão não encontrar um binário isort válido, ela voltará a usar a versão agrupada do isort.","settings.importStrategy.useBundled.description":"Sempre use a versão agrupada do isort fornecida com a extensão.","settings.interpreter.description":"Caminho para um executável do Python ou um comando que será usado para iniciar o servidor isort e qualquer subprocesso. Aceita uma matriz de uma ou várias cadeias de caracteres. Quando definida como \"[]\", a extensão usará o caminho para o interpretador do Python selecionado.","settings.path.description":"Caminho do binário isort a ser usado por essa extensão. Observação: isso pode tornar a formatação mais lenta. <br> Exemplos: <br>- `\"isort.path\" : [\"~/global_env/isort\"]` <br> - `\"isort.path\" : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]`. ","settings.serverEnabled.description":"Configuração **Experimental** para controlar se é necessário executar o isort em um modo semelhante a servidor. Por padrão, 'isort' é executado atrás do servidor LSP, mas você pode desabilitar essa configuração para executar o isort diretamente. Desabilitar essa configuração também desabilitará a classificação de importação por meio de Ações de Código ou Organizar Importações, mas você ainda poderá classificar importações por meio do comando **isort: Sort Imports**.","settings.severity.description":"Mapeamento dos tipos de mensagens do isort para os níveis de gravidade de diagnóstico conforme exibido na janela Problemas.","settings.showNotifications.always.description":"Mostrar todas as notificações.","settings.showNotifications.description":"Controla quando as notificações são mostradas por esta extensão.  Os valores aceitos são `onError`, `onWarning`, `always` e `off`.","settings.showNotifications.off.description":"Nunca exibir uma notificação. Todos os erros ou avisos ainda estão disponíveis nos logs.","settings.showNotifications.onError.description":"Mostrar notificações de erros.","settings.showNotifications.onWarning.description":"Mostrar notificações de erros e avisos."}
