{"command.restartServer":"Redémarrer le serveur","extension.description":"Prise en charge de l'organisation d'importation pour les fichiers Python à l'aide d'isort.","settings.args.description":"Arguments passés à isort pour organiser les importations dans les fichiers Python. Chaque argument doit être fourni sous forme de chaîne distincte dans le tableau. <br> Exemple : <br> `\"isort.args\" = [\"--settings-file\", \"<file>\"]`","settings.check.description":"S'il faut exécuter « isort --check » sur les fichiers Python ouverts et signaler les problèmes de tri sous forme d'« indice » dans la fenêtre Problèmes. Vous pouvez mettre à jour « isort.severity » pour afficher les problèmes de tri avec une gravité plus élevée. ","settings.importStrategy.description":"Définit le binaire isort à utiliser pour linter les fichiers Python. Lorsqu'elle est définie sur « useBundled », l'extension utilisera le binaire isort fourni avec l'extension. Lorsqu'elle est définie sur « fromEnvironment », l'extension tentera d'utiliser le binaire isort et toutes les dépendances disponibles dans l'environnement actuellement sélectionné. Remarque : Si l'extension ne trouve pas de binaire isort valide dans l'environnement sélectionné, elle utilisera le binaire isort fourni avec l'extension. Le paramètre `isort.path` peut également être ignoré lorsque ce paramètre est défini sur ` fromEnvironnement`. ","settings.importStrategy.fromEnvironment.description":"Utilisez isort à partir de l’environnement sélectionné. Si l'extension ne parvient pas à trouver un binaire isort valide, elle utilisera la version fournie d'isort.","settings.importStrategy.useBundled.description":"Utilisez toujours la version fournie d'isort livrée avec l'extension.","settings.interpreter.description":"Chemin d'accès à un exécutable Python ou à une commande qui sera utilisée pour lancer le serveur isort et tout sous-processus. Accepte un tableau d'une ou plusieurs chaînes. Lorsqu'elle est définie sur `[]`, l'extension utilisera le chemin d'accès à l'interpréteur Python sélectionné.","settings.path.description":"Chemin du binaire isort à utiliser par cette extension. Remarque : Cela peut ralentir le formatage. <br> Exemples : <br>- `isort.path : [\"~/global_env/isort\"]` <br> - `isort.path : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]`. ","settings.serverEnabled.description":"Paramètre **expérimental** pour contrôler s'il faut exécuter isort en mode de type serveur. Par défaut, « isort » est exécuté derrière le serveur LSP, mais vous pouvez désactiver ce paramètre pour exécuter isort directement. La désactivation de ce paramètre désactivera également le tri des importations via les actions de code ou l'organisation des importations, mais vous pouvez toujours trier les importations via la commande **isort : trier les importations**.","settings.severity.description":"Mappage des types de messages d'isort aux niveaux de gravité des diagnostics de VS Code tels qu'affichés dans la fenêtre Problèmes.","settings.showNotifications.always.description":"Afficher toutes les notifications.","settings.showNotifications.description":"Contrôle quand les notifications sont affichées par cette extension.  Les valeurs acceptées sont 'onError', 'onWarning', 'always' et 'off'.","settings.showNotifications.off.description":"Ne jamais afficher de notification. Les erreurs ou les avertissements sont toujours disponibles dans les journaux.","settings.showNotifications.onError.description":"Afficher les notifications pour les erreurs.","settings.showNotifications.onWarning.description":"Afficher les notifications d’erreurs et d’avertissements."}
