{"command.restartServer":"Restartovat server","extension.description":"Umožňuje naimportovat podporu organizace pro soubory Pythonu pomocí souboru isort.","settings.args.description":"Argumenty předané souboru isort pro uspořádání importů v souborech Pythonu. Každý argument by měl být v poli zadán jako samostatný řetězec. <br> Příklad: <br> `\"isort.args\" : [\"--settings-file\", \"<file>\"]`","settings.check.description":"Určuje, jestli se má pro otevřené soubory Pythonu spustit isort --check a jestli se mají hlásit problémy s řazením v podobě tipu v okně Problémy. Pokud chcete zobrazit problémy s řazením, které mají vyšší závažnost, můžete si aktualizovat nastavení isort.severity. ","settings.importStrategy.description":"Definuje, který binární soubor isort se má použít k lintování souborů Pythonu. Pokud je nastaveno na useBundled, rozšíření použije binární soubor isort, který je dodáván s rozšířením. Pokud je nastaveno na fromEnvironment, rozšíření se pokusí použít binární soubor isort a všechny závislosti, které jsou k dispozici v aktuálně vybraném prostředí. Poznámka: Pokud rozšíření nemůže ve vybraném prostředí najít platný binární soubor isort, použije se binární soubor isort dodávaný s rozšířením. Pokud je toto nastavení nakonfigurováno na fromEnvironment, může být ignorováno také nastavení isort.path. ","settings.importStrategy.fromEnvironment.description":"Umožňuje použít isort z vybraného prostředí. Pokud rozšíření nenajde platný binární soubor isort, použije místo toho zkompletovanou verzi isort dodávanou s rozšířením.","settings.importStrategy.useBundled.description":"Bude vždy používat zkompletovanou verzi souboru isort dodanou s rozšířením.","settings.interpreter.description":"Cesta ke spustitelnému souboru Pythonu nebo k příkazu, který se použije ke spuštění serveru isort a jakéhokoli podprocesu. Přijímá pole jednoho nebo více řetězců. Když se nastaví na [], rozšíření použije cestu k vybranému interpretu Pythonu.","settings.path.description":"Cesta k binárnímu souboru isort, který má být použit tímto rozšířením. Poznámka: Může to zpomalit formátování. <br> Příklady: <br>- `\"isort.path\" : [\"~/global_env/isort\"]` <br> - `\"isort.path\" : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]`. ","settings.serverEnabled.description":"**Experimentální** nastavení určující, jestli se má spouštět isort v režimu podobném serveru. Ve výchozím nastavení se isort spouští za serverem LSP, ale toto nastavení můžete zakázat, aby se spouštěl přímo. Zakázáním tohoto nastavení také zakážete řazení importu prostřednictvím akcí kódu nebo uspořádání importů, ale importy můžete řadit pomocí příkazu **isort: Sort Imports**.","settings.severity.description":"Mapování typů zpráv isort na diagnostické úrovně závažnosti VS Code, jak se zobrazují v okně Problémy.","settings.showNotifications.always.description":"Zobrazí všechna oznámení.","settings.showNotifications.description":"Určuje, kdy toto rozšíření zobrazuje oznámení.  Přípustné hodnoty jsou onError, onWarning, always a off.","settings.showNotifications.off.description":"Nikdy nezobrazí oznámení. Všechny chyby nebo upozornění jsou stále k dispozici v protokolech.","settings.showNotifications.onError.description":"Zobrazí oznámení o chybách.","settings.showNotifications.onWarning.description":"Zobrazí oznámení o chybách a upozorněních."}
