{"command.restartServer":"Перезапустить сервер","extension.description":"Поддержка упорядочения импорта для файлов Python с использованием isort.","settings.args.description":"Аргументы, передаваемые в isort для упорядочения импорта в файлах Python. Каждый аргумент должен быть указан как отдельная строка в массиве. <br> Пример: <br> `\"isort.args\" : [\"--settings-file\", \"<file>\"]`","settings.check.description":"Следует ли запускать команду \"isort --check\" для открытых файлов Python и сообщать о проблемах сортировки в виде \"указания\" в окне \"Проблемы\". Вы можете обновить \"isort.severity\", чтобы отобразить проблемы сортировки с более высоким уровнем серьезности. ","settings.importStrategy.description":"Определяет, какой двоичный файл isort будет использоваться для анализа кода файлов Python. Если для этого параметра задано значение \"useBundled\" (использовать пакетный), расширение будет использовать двоичный файл isort, поставляемый вместе с расширением. Если задан параметр \"fromEnvironment\" (из среды), расширение попытается использовать двоичный файл isort и все зависимости, доступные в текущей среде. Примечание. Если расширение не может найти допустимый двоичный файл isort в выбранной среде, оно будет использовать двоичный файл isort, который поставляется вместе с расширением. Значение параметра \"isort.path\" может также игнорироваться, если для этого параметра установлено \"fromEnvironment\". ","settings.importStrategy.fromEnvironment.description":"Используйте isort из выбранной среды. Если расширению не удается найти допустимый двоичный файл isort, оно будет использовать пакетную версию isort.","settings.importStrategy.useBundled.description":"Всегда использовать пакетную версию isort, поставляемую с расширением.","settings.interpreter.description":"Путь к исполняемому файлу Python или команде, которая будет использоваться для запуска сервера isort и всех подпроцессов. Принимает массив из одной или нескольких строк. Если задано значение \"[]\", расширение будет использовать путь к выбранному интерпретатору Python.","settings.path.description":"Путь к двоичному файлу isort, используемому этим расширением. Примечание. Это может замедлить форматирование. <br> Примеры: <br>- `\"isort.path\" : [\"~/global_env/isort\"]` <br> - `\"isort.path\" : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]`. ","settings.serverEnabled.description":"**Экспериментальный** параметр для управления тем, следует ли выполнять isort в серверном режиме. По умолчанию \"isort\" выполняется за LSP-сервером, но вы можете отключить этот параметр, чтобы выполнять isort напрямую. Отключение этого параметра также отключит сортировку импорта с помощью действий кода или упорядочения импорта, но вы по-прежнему можете сортировать операции импорта с помощью команды **isort: Sort Imports**.","settings.severity.description":"Сопоставление типов сообщений isort с уровнями серьезности диагностики VS Code для показа в окне \"Проблемы\".","settings.showNotifications.always.description":"Показывать все уведомления","settings.showNotifications.description":"Определяет, когда это расширение показывает уведомления.  Допустимые значения: \"onError\" (в случае ошибки), \"onWarning\" (в случае предупреждения), \"always\" (всегда) и \"off\" (отключено).","settings.showNotifications.off.description":"Никогда не показывать уведомлений. Все ошибки и предупреждения по-прежнему доступны в журналах.","settings.showNotifications.onError.description":"Показывать уведомления в случае ошибок.","settings.showNotifications.onWarning.description":"Показ уведомлений об ошибках и предупреждениях."}
