{"command.restartServer":"Ponowne uruchamianie serwera","extension.description":"Importuj obsługę organizacji dla plików języka Python przy użyciu narzędzia isort.","settings.args.description":"Argumenty przekazywane do narzędzia isort na potrzeby organizowania importów w plikach języka Python. Każdy argument powinien być podany jako oddzielny ciąg w tablicy. <br> Przykład: <br> \"isort.args\" = [\"--settings-file\", \"<file>\"]\"","settings.check.description":"Określa, czy uruchomić polecenie „isort --check” dla otwartych plików języka Python i zgłosić problemy z sortowaniem jako „Wskazówka” w oknie Problemy. Możesz zaktualizować plik „isort.severity”, aby pokazać problemy z sortowaniem o wyższej ważności. ","settings.importStrategy.description":"Definiuje, które dane binarne mają być używany do sprawdzania lint plików języka Python. Po ustawieniu wartości „useBundled” rozszerzenie będzie używać danych binarnych narzędzia isort dostarczonych z rozszerzeniem. Po ustawieniu na wartość „fromEnvironment” rozszerzenie podejmie próbę użycia danych binarnych narzędzia isort i wszystkich zależności dostępnych w obecnie wybranym środowisku. Uwaga: jeśli rozszerzenie nie może odnaleźć prawidłowych danych binarnych narzędzia isort w wybranym środowisku, powróci do użycia danych binarnych narzędzia isort dostarczonych z rozszerzeniem. Ustawienie „isort.path” może być również ignorowane, gdy ma ono wartość „fromEnvironment”. ","settings.importStrategy.fromEnvironment.description":"Użyj narzędzia isort z wybranego środowiska. Jeśli rozszerzenie nie może odnaleźć prawidłowych danych binarnych narzędzia isort, powróci do używania dołączonej do pakietu wersji narzędzia isort.","settings.importStrategy.useBundled.description":"Zawsze używaj dołączonej wersji narzędzia isort dostarczanej z rozszerzeniem.","settings.interpreter.description":"Ścieżka do pliku wykonywalnego w języku Python lub polecenia, które będzie używane do uruchamiania serwera narzędzia isort i dowolnego podprocesu. Akceptuje tablicę jednego lub wielu ciągów. Po ustawieniu wartości na „[]” rozszerzenie użyje ścieżki do wybranego interpretera języka Python.","settings.path.description":"Ścieżka danych binarnych narzędzia isort, które mają być używane przez to rozszerzenie. Uwaga: może to spowolnić formatowanie. <br> Przykłady: <br>— `\"isort.path\" : [\"~/global_env/isort\"]` <br> - `\"isort.path\" : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]`. ","settings.serverEnabled.description":"Ustawienie **Eksperymentalne** w celu określenia, czy narzędzie isort ma być uruchamiane w trybie podobnym do serwera. Domyślnie narzędzie „isort” jest uruchamiane za serwerem LSP, ale możesz wyłączyć to ustawienie, aby uruchamiać narzędzie isort bezpośrednio. Wyłączenie tego ustawienia spowoduje również wyłączenie sortowania importu za pomocą akcji kodu lub organizowania importów, ale nadal możesz sortować importy za pomocą polecenia **isort: Sort Imports**.","settings.severity.description":"Mapowanie typów komunikatów narzędzia isort z poziomami ważności diagnostycznej edytora VS Code, jak pokazano w oknie Problemy.","settings.showNotifications.always.description":"Pokaż wszystkie powiadomienia.","settings.showNotifications.description":"Określa, kiedy powiadomienia są wyświetlane przez to rozszerzenie.  Akceptowane wartości to „onError”, „onWarning”, „always” i „off”.","settings.showNotifications.off.description":"Nigdy nie wyświetlaj powiadomienia. Wszelkie błędy lub ostrzeżenia są nadal dostępne w dziennikach.","settings.showNotifications.onError.description":"Pokaż powiadomienia o błędach.","settings.showNotifications.onWarning.description":"Pokaż powiadomienia o błędach i ostrzeżeniach."}
