{"command.restartServer":"Reiniciar servidor","extension.description":"Soporte de la organización de importación para archivos Python usando “isort”.","settings.args.description":"Argumentos pasados a isort para organizar las importaciones en archivos de Python. Cada argumento debe proporcionarse como una cadena independiente en la matriz. <br> ejemplo: <br> `\"isort.args\" = [\"--settings-file\", \"<file>\"]`","settings.check.description":"Indica si se debe ejecutar \"isort --check\" en archivos de Python abiertos y notificar problemas de ordenación como una \"sugerencia\" en la ventana Problemas. Puede actualizar \"isort.severity\" para mostrar los problemas de ordenación con una gravedad mayor. ","settings.importStrategy.description":"Define qué binario de isort se va a usar para analizar los archivos de Python. Cuando se establece en \"useBundled\", la extensión usará el binario isort que se incluye con la extensión. Cuando se establece en \"fromEnvironment\", la extensión intentará usar el binario de isort y todas las dependencias disponibles en el entorno seleccionado actualmente. Nota: Si la extensión no encuentra un archivo binario de isort válido en el entorno seleccionado, volverá a usar el binario de isort que se incluye con la extensión. También se puede omitir el valor \"isort.path\" cuando este se establece en \"fromEnvironment\". ","settings.importStrategy.fromEnvironment.description":"Use isort del entorno seleccionado. Si la extensión no encuentra un binario isort válido, se revertirá al uso de la versión empaquetada de isort.","settings.importStrategy.useBundled.description":"Use siempre la versión empaquetada de isort incluida con la extensión.","settings.interpreter.description":"Ruta de acceso a un ejecutable de Python o un comando que se usará para iniciar el servidor isort y cualquier subproceso. Acepta una matriz de una o varias cadenas. Cuando se establece en '[]', la extensión usará la ruta de acceso al intérprete de Python seleccionado.","settings.path.description":"Ruta de acceso del binario isort que va a usar esta extensión. Nota: Esto puede ralentizar la aplicación de formato. <br> ejemplos: <br>- “isort.path : [\"~/global_env/isort\"]” <br> - “isort.path : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]”. ","settings.serverEnabled.description":"**Experimental** para controlar si se ejecuta isort en un modo similar a un servidor. De forma predeterminada, \"isort\" se ejecuta detrás del servidor LSP, pero puede deshabilitar esta configuración para ejecutar isort directamente. Al deshabilitar esta configuración, también se deshabilitará la ordenación de importación a través de acciones de código u organizar importaciones, pero todavía puede ordenar las importaciones mediante el comando **isort: Sort Imports**.","settings.severity.description":"Asignación de los tipos de mensaje de isort a los niveles de gravedad de diagnóstico de VS Code como se muestra en la ventana Problemas.","settings.showNotifications.always.description":"Mostrar todas las notificaciones.","settings.showNotifications.description":"Controla cuándo se muestran las notificaciones mediante esta extensión.  Los valores aceptados son \"onError\", \"onWarning\", \"always\" y \"off\".","settings.showNotifications.off.description":"No se muestra nunca una notificación. Los errores o advertencias aún están disponibles en los registros.","settings.showNotifications.onError.description":"Mostrar notificaciones de errores.","settings.showNotifications.onWarning.description":"Se muestran notificaciones de errores y advertencias."}
