{"command.restartServer":"Sunucuyu Yeniden Başlatın","extension.description":"isort kullanarak Python dosyaları için kuruluş desteğini içe aktarın.","settings.args.description":"Python dosyalarındaki içeri aktarmaları düzenlemek için isort'a geçirilen bağımsız değişkenler. Her bağımsız değişken dizide ayrı bir dize olarak sağlanmalıdır. <br> Örnek: <br> `\"isort.args\" : [\"--settings-file\", \"<file>\"]`","settings.check.description":"Açık Python dosyalarında \"isort --check\" komutunun çalıştırılıp çalıştırılmayacağı ve sıralama sorunlarının Sorunlar penceresinde \"İpucu\" olarak raporlanıp raporlanmayacağı. Daha yüksek önem derecesine sahip sıralama sorunlarını göstermek için şunu güncelleştirebilirsiniz: 'isort.severity'. ","settings.importStrategy.description":"Python dosyalarına lint uygulamak için kullanılacak isort ikili dosyasını tanımlar. `useBundled` olarak ayarlandığında uzantı, uzantıyla birlikte gönderilen isort ikili dosyasını kullanır. `fromEnvironment` olarak ayarlandığında, uzantı isort ikili dosyasını ve şu anda seçili ortamda kullanılabilen tüm bağımlılıkları kullanmaya çalışılır. Not: Uzantı seçili ortamda geçerli bir isort ikili dosyası bulamazsa, uzantıyla birlikte gönderilen isort ikili dosyasını kullanmaya geri döner. Bu ayar `fromEnvironment` olarak ayarlandığında `isort.path` ayarı da yoksayılabilir. ","settings.importStrategy.fromEnvironment.description":"Seçili ortamdan isort kullanın. Uzantı geçerli bir isort ikili dosyası bulamazsa, isort’un paketlenmiş sürümünü kullanmaya geri döner.","settings.importStrategy.useBundled.description":"Her zaman uzantıyla birlikte gönderilen isort’un paketlenmiş sürümünü kullan.","settings.interpreter.description":"isort sunucusunu ve herhangi bir alt süreci başlatmak için kullanılacak bir Python yürütülebilir dosyasının veya komutun yolu. Tek veya birden çok dizenin dizisini kabul eder. `[]` olarak ayarlandığında, uzantı seçili Python yorumlayıcısının yolunu kullanır.","settings.path.description":"Bu uzantı tarafından kullanılacak isort ikili dosyasının yolu. Not: Bu, biçimlendirmeyi yavaşlatabilir. <br> Örnekler: <br>- `\"isort.path\" : [\"~/global_env/isort\"]` <br> - `\"isort.path\" : [\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"isort\"]`. ","settings.serverEnabled.description":"Sunucu benzeri bir modda isort'un çalıştırılıp çalıştırılmayacağını denetlemek için **deneysel** ayar. Varsayılan olarak 'isort' LSP sunucusunun arkasında çalıştırılır, ancak isort'u doğrudan çalıştırmak için bu ayarı devre dışı bırakabilirsiniz. Bu ayarın devre dışı bırakılması, Kod Eylemleri veya İçe Aktarmaları Düzenleme aracılığıyla içe aktarma sıralamasını da devre dışı bırakır, ancak içe aktarmaları **isort: Sort Imports** komutu aracılığıyla da sıralayabilirsiniz.","settings.severity.description":"isort'un ileti türlerinin, Sorunlar penceresinde görüntülendiği şekilde VS Code'un tanılama önem düzeyleriyle eşlenmesi.","settings.showNotifications.always.description":"Tüm bildirimleri göster.","settings.showNotifications.description":"Bildirimlerin bu uzantı tarafından ne zaman gösterileceğini kontrol eder.  Kabul edilen değerler: `onError`, `onWarning`, `always` ve `off`.","settings.showNotifications.off.description":"Hiçbir zaman bildirim görüntüleme. Tüm hatalar veya uyarılar günlüklerde kalır.","settings.showNotifications.onError.description":"Hatalar için bildirimleri göster.","settings.showNotifications.onWarning.description":"Hata ve uyarı bildirimlerini göster."}
